slides/aula10/aula10.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Sistemas de tipos</title>
<meta name="author" content="Construção de compiladores I"/>
<link rel="stylesheet" href="file:///home/rodrigo/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="file:///home/rodrigo/reveal.js/dist/theme/white.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Sistemas de tipos</h1><h2 class="author">Construção de compiladores I</h2>
</section>
<section>
<section id="slide-org68dee45">
<h2 id="org68dee45">Objetivos</h2>
<div class="outline-text-2" id="text-org68dee45">
</div>
</section>
<section id="slide-org797eae9">
<h3 id="org797eae9">Objetivos</h3>
<ul>
<li>Apresentar os conceitos de tipagem dinâmica e estática em linguagens.</li>

<li>Mostrar como especificar a análise semântica utilizando um sistema de tipos.</li>

</ul>
</section>
<section id="slide-org7b1f76d">
<h3 id="org7b1f76d">Objetivos</h3>
<ul>
<li>Apresentar as propriedades teóricas relevantes em sistemas de tipos.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orga7f2bcd">
<h2 id="orga7f2bcd">Motivação</h2>
<div class="outline-text-2" id="text-orga7f2bcd">
</div>
</section>
<section id="slide-orge7f8a6d">
<h3 id="orge7f8a6d">Motivação</h3>
<ul>
<li>Praticamente todas as linguagens de programação utilizam alguma forma de <b>tipo</b>.</li>

<li>Apesar de não parecer, algumas linguagens usam tipos durante a execução&#x2026;
<ul>
<li>Chamamos isso de <b>tipagem dinâmica</b>.</li>
<li>Exemplos: Python, Javascript e Lua.</li>

</ul></li>

</ul>
</section>
<section id="slide-org7294f40">
<h3 id="org7294f40">Motivação</h3>
<ul>
<li>Quando a verificação é feita durante o processo de compilação, chamamos de <b>tipagem estática</b>.
<ul>
<li>Exemplos: C/C++, Java, Haskell e Rust.</li>

</ul></li>

</ul>
</section>
<section id="slide-org17c7ee5">
<h3 id="org17c7ee5">Motivação</h3>
<ul>
<li>Algumas vantagens do uso de tipos:
<ul>
<li>Prevenção de erros e segurança.</li>

<li>Manutenibilidade e reuso de código.</li>

<li>Otimização de código.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgc40901c">
<h3 id="orgc40901c">Motivação</h3>
<ul>
<li>Algumas vantagens do uso de tipos:
<ul>
<li>Gerenciamento de memória.</li>

<li>Suporte a polimorfismo e abstração.</li>

<li>Desenvolvimento dirigido por tipos.</li>

</ul></li>

</ul>
</section>
<section id="slide-org3a407af">
<h3 id="org3a407af">Motivação</h3>
<ul>
<li>Exemplo (Python)</li>

</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">x</span> = <span style="color: #a45bad;">5</span>;
<span style="color: #7590db;">y</span> = <span style="color: #2d9574;">"teste"</span>;
x + y;
</pre>
</div>
</section>
<section id="slide-orgd66e1ff">
<h3 id="orgd66e1ff">Motivação</h3>
<ul>
<li>Exemplo (C)</li>

</ul>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #bc6ec5; font-weight: bold;">createArray</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arr</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span> = <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span>,<span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">}</span>;
  <span style="color: #4f97d7; font-weight: bold;">return</span> arr
<span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">ptr</span> = createArray<span style="color: #bc6ec5;">()</span>;
  printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"%d"</span>,ptr<span style="color: #2d9574;">[</span><span style="color: #a45bad;">0</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</section>
<section id="slide-org3b00dbe">
<h3 id="org3b00dbe">Motivação</h3>
<ul>
<li>Exemplo (Rust)</li>

</ul>

<div class="org-src-container">

<pre class="src src-rust"><span style="color: #4f97d7; font-weight: bold;">fn</span> <span style="color: #bc6ec5; font-weight: bold;">create_array</span><span style="color: #4f97d7;">()</span> -&gt; <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span><span style="color: #ce537a; font-weight: bold;">Vec</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">i32</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">arr</span> = <span style="color: #bc6ec5;">vec!</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span>,<span style="color: #a45bad;">5</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #b2b2b2; background-color: #292b2e;">&amp;</span>arr
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</section>
<section id="slide-org35b4d55">
<h3 id="org35b4d55">Motivação</h3>
<ul>
<li>Sistemas de tipos são uma técnica de análise para evitar comportamentos indesejados em programas.</li>

<li>Para entender melhor sistemas de tipos, vamos incluir tipos na linguagem L2.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgfb731dd">
<h2 id="orgfb731dd">A linguagem L3</h2>
<div class="outline-text-2" id="text-orgfb731dd">
</div>
</section>
<section id="slide-orgb087d5c">
<h3 id="orgb087d5c">A linguagem L3</h3>
<ul>
<li>A linguagem L3 permite a declaraçãod e tipos de variáveis.</li>

<li>Para isso, inclui:

<ul>
<li>Booleanos e operações sobre estes.</li>

<li>Strings e operações sobre estas.</li>

</ul></li>

</ul>
</section>
<section id="slide-orge0495e8">
<h3 id="orge0495e8">A linguagem L3</h3>
<ul>
<li>Sintaxe de L3</li>

</ul>

<div>
\begin{array}{ll}
P & \to\:  S\, P\:|\:\lambda\\
S & \to\:  let\:v : \tau := E ;\\
  & \mid\: read(E,v);\,|\,print(E); \,|\, S_1 ; S_2\\
T & \mid\:Int\,|\,Bool\,|\,String
\end{array}

</div>
</section>
<section id="slide-org1f06354">
<h3 id="org1f06354">A linguagem L3</h3>
<ul>
<li>Sintaxe de L3</li>

</ul>

<div>
\begin{array}{ll}
E & \to\:  n \,|\, v \,|\, s\,|\, b\,|\,E + E\,|\, E - E\,|\,E*E\\
  & \mid\:E < E\,|\,E = E\,|\,E / E\,|\,E\,\&\&\,E\,|\,!\,E\\
  & \mid\: strcat(E,E)\,|\,strsize(E)\,|\,i2s(E)\,|\,i2b(E)\\
  & \mid\: b2s(E)\,|\,b2i(E)\,|\,s2i(E)\,|\,s2b(E)\\
\end{array}

</div>
</section>
<section id="slide-org2972efa">
<h3 id="org2972efa">A linguagem L3</h3>
<ul>
<li>Semântica de L3
<ul>
<li>Idêntica a de L2.</li>

</ul></li>

<li>Novas operações:
<ul>
<li>Operações sobre strings.</li>
<li>Operações para conversão entre tipos.</li>

</ul></li>

</ul>
</section>
<section id="slide-org03ffee9">
<h3 id="org03ffee9">A linguagem L3</h3>
<ul>
<li>Operações sobre string:
<ul>
<li><code>strcat</code> : concatenação de string</li>
<li><code>strsize</code> : tamanho de uma string</li>

</ul></li>

</ul>
</section>
<section id="slide-orga5b143a">
<h3 id="orga5b143a">A linguagem L3</h3>
<ul>
<li>Operações de conversão entre tipos:
<ul>
<li><code>i2s</code>: conversão de inteiro para string.</li>
<li><code>i2b</code>: conversão de inteiro para booleano.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgaeedffd">
<h3 id="orgaeedffd">A linguagem L3</h3>
<ul>
<li>Novas operações:
<ul>
<li><code>s2b</code>: conversão de string para booleano</li>
<li><code>i2b</code>: conversão de inteiro para booleano.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgc2e0d54">
<h3 id="orgc2e0d54">A linguagem L3</h3>
<ul>
<li>Operações de conversão entre tipos:
<ul>
<li><code>b2i</code>: conversão de booleano para inteiro.</li>
<li><code>b2s</code>: conversão de booleano para string.</li>

</ul></li>

</ul>
</section>
<section id="slide-orgf6456c1">
<h3 id="orgf6456c1">A linguagem L3</h3>
<ul>
<li>Representamos um sistema de tipos por um conjunto de regras de dedução para
<ul>
<li>\(\Gamma \vdash P\leadsto \Gamma'\)</li>

</ul></li>

<li>Dado um contexto &Gamma; e um programa P, produzimos um novo contexto &Gamma;'
contendo as declarações de variáveis presentes em P</li>

</ul>
</section>
<section id="slide-org174ac38">
<h3 id="org174ac38">A linguagem L3</h3>
<ul>
<li>Representação das regras de tipos para expressões</li>

<li>\(\Gamma \vdash E : T\) é dedutível se a expressão E possui o tipo T no contexto &Gamma;.</li>

</ul>
</section>
<section id="slide-org82cd891">
<h3 id="org82cd891">A linguagem L3</h3>
<ul>
<li>Regras para constantes e variáveis</li>

</ul>

<div>
\begin{array}{cc}
  \dfrac{}{\Gamma \vdash n : Int} &
  \dfrac{}{\Gamma \vdash s : String} \\ \\
  \dfrac{}{\Gamma \vdash b : Bool} &
  \dfrac{\Gamma(v) = T}{\Gamma \vdash v : T}
\end{array}

</div>
</section>
<section id="slide-org7c52664">
<h3 id="org7c52664">A linguagem L3</h3>
<ul>
<li>Operações aritméticas</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma \vdash E_1 : Int\:\:\:\:\Gamma\vdash E_2 : Int}
        {\Gamma \vdash E_1 \bullet E_2 : Int}\\ \\

  \bullet \in \{+,-,*,/\}
\end{array}

</div>
</section>
<section id="slide-orga08a655">
<h3 id="orga08a655">A linguagem L3</h3>
<ul>
<li>Operações booleanos</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma \vdash E_1 : Bool\:\:\:\:\Gamma\vdash E_2 :Bool}
        {\Gamma \vdash E_1 \&\& E_2 : Bool}\\ \\
  \dfrac{\Gamma \vdash E_1 : Bool}
        {\Gamma \vdash !\,E_1 : Bool}\\ \\
\end{array}

</div>
</section>
<section id="slide-org7399fed">
<h3 id="org7399fed">A linguagem L3</h3>
<ul>
<li>Operações relacionais</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma \vdash E_1 : T\:\:\:\:\Gamma\vdash E_2 : T}
        {\Gamma \vdash E_1 \bullet E_2 : Bool}\\ \\

  \bullet \in \{<,=\}
\end{array}

</div>
</section>
<section id="slide-org76b55c8">
<h3 id="org76b55c8">A linguagem L3</h3>
<ul>
<li>Operações sobre strings</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma \vdash E_1 : String\:\:\:\:\:\Gamma\vdash E_2 : String}
        {\Gamma \vdash strcat(E_1,E_2) : Bool} \\ \\
  \dfrac{\Gamma \vdash E_1 : String}
        {\Gamma \vdash strsize(E_1) : Int} \\ \\
\end{array}

</div>
</section>
<section id="slide-org8ff446e">
<h3 id="org8ff446e">A linguagem L3</h3>
<ul>
<li>Conversões de tipos</li>

</ul>

<div>
\begin{array}{cc}
  \dfrac{\Gamma \vdash E_1 : Int}
        {\Gamma \vdash i2s(E_1) : String} &
  \dfrac{\Gamma \vdash E_1 : Int}
        {\Gamma \vdash i2b(E_1) : Bool}
\end{array}

</div>
</section>
<section id="slide-orgcc577ff">
<h3 id="orgcc577ff">A linguagem L3</h3>
<ul>
<li>Conversões de tipos</li>

</ul>

<div>
\begin{array}{cc}
  \dfrac{\Gamma \vdash E_1 : Bool}
        {\Gamma \vdash b2s(E_1) : String} &
  \dfrac{\Gamma \vdash E_1 : Bool}
        {\Gamma \vdash b2i(E_1) : Int}
\end{array}

</div>
</section>
<section id="slide-org6132ecd">
<h3 id="org6132ecd">A linguagem L3</h3>
<ul>
<li>Conversões de tipos</li>

</ul>

<div>
\begin{array}{cc}
  \dfrac{\Gamma \vdash E_1 : String}
        {\Gamma \vdash s2b(E_1) : Bool} &
  \dfrac{\Gamma \vdash E_1 : String}
        {\Gamma \vdash s2i(E_1) : Int}
\end{array}

</div>
</section>
<section id="slide-org935e811">
<h3 id="org935e811">A linguagem L3</h3>
<ul>
<li>Definição de variáveis.</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma(v) = \bot\:\:\:\:\Gamma \vdash E_1 : T}
        {\Gamma \vdash let\:v : T = E_1 \leadsto \Gamma , v : T}
\end{array}

</div>
</section>
<section id="slide-orgddfda74">
<h3 id="orgddfda74">A linguagem L3</h3>
<ul>
<li>Atribuição.</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma(v) = T\:\:\:\:\Gamma \vdash E_1 : T}
        {\Gamma \vdash v := E_1 \leadsto \Gamma}
\end{array}

</div>
</section>
<section id="slide-org70cab22">
<h3 id="org70cab22">A linguagem L3</h3>
<ul>
<li>Comando read.</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma\vdash E_1 : String \:\:\:\:\Gamma(v) = T}
        {\Gamma\vdash read(E_1, v) \leadsto \Gamma}
\end{array}

</div>
</section>
<section id="slide-orgc6197d3">
<h3 id="orgc6197d3">A linguagem L3</h3>
<ul>
<li>Comando print.</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma\vdash E_1 : String}
        {\Gamma\vdash print(E_1) \leadsto \Gamma}
\end{array}

</div>
</section>
<section id="slide-org0403438">
<h3 id="org0403438">A linguagem L3</h3>
<ul>
<li>Sequência de comandos</li>

</ul>

<div>
\begin{array}{c}
  \dfrac{\Gamma\vdash S_1 \leadsto \Gamma_1\:\:\:\:\Gamma_1\vdash S_2 \leadsto \Gamma'}
        {\Gamma\vdash S_1 ; S_2 \leadsto \Gamma'}
\end{array}

</div>
</section>
</section>
<section>
<section id="slide-org96a602a">
<h2 id="org96a602a">Propriedades</h2>
<div class="outline-text-2" id="text-org96a602a">
</div>
</section>
<section id="slide-org1a9965e">
<h3 id="org1a9965e">Propriedades</h3>
<ul>
<li>Um sistema de tipos é semanticamente correto se programas aceitos pelo sistema de tipos não
resultam em erros de tempo de execução.</li>

<li>Essa propriedade é conhecida como <b>soundness</b>.</li>

</ul>
</section>
<section id="slide-orgdaee56a">
<h3 id="orgdaee56a">Propriedades</h3>
<ul>
<li>O soundness é normalmente dividido em duas demonstrações:
<ul>
<li>Progresso: Se \(\Gamma \vdash E : T\) então E é um valor ou pode ser avaliado a um valor.</li>
<li>Preservação: Se \(\Gamma \vdash E : T\) então existe v tal que E &dArr; v e \(\Gamma \vdash v : T\).</li>

</ul></li>

</ul>
</section>
<section id="slide-org712b6db">
<h3 id="org712b6db">Propriedades</h3>
<ul>
<li>Demonstrar o soundness de um sistema de tipos é uma tarefa importante do projeto de uma linguagem.</li>

<li>Diversos trabalhos de pesquisa dedicam-se a esta finalidade.</li>

</ul>
</section>
<section id="slide-org39b8e41">
<h3 id="org39b8e41">Propriedades</h3>
<ul>
<li>Atualmente, grande parte das pesquisas na área usam assistentes de provas, como Coq e Lean, para
validar essas demonstrações.</li>

</ul>
</section>
<section id="slide-orgd4895c8">
<h3 id="orgd4895c8">Propriedades</h3>
<ul>
<li>Existem linguagens que possuem tipos e não atendem essas propriedades?</li>

</ul>
</section>
<section id="slide-org85dfede">
<h3 id="org85dfede">Propriedades</h3>
<ul>
<li>C não atende progresso.
<ul>
<li>Programas C podem não reduzir a valores, mesmo sendo bem tipados, por falhas de
acesso a posições inválidas de memória, buffer overflow, dereferenciação de ponteiros nulos, etc.</li>

</ul></li>

</ul>
</section>
<section id="slide-org81f9a51">
<h3 id="org81f9a51">Propriedades</h3>
<ul>
<li>C não atende preservação.
<ul>
<li>Programas C que usam aritmética de ponteiros e casts inválidos não atendem preservação.</li>

</ul></li>

</ul>
</section>
<section id="slide-org08b433d">
<h3 id="org08b433d">Propriedades</h3>
<ul>
<li>Existem linguagens que atendem essas propriedades?
<ul>
<li>Haskell, Standard ML e partes de Rust são exemplos de linguagens que possuem provas de progresso e prevervação.</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd60339a">
<h2 id="orgd60339a">Conclusão</h2>
<div class="outline-text-2" id="text-orgd60339a">
</div>
</section>
<section id="slide-org1044efa">
<h3 id="org1044efa">Conclusão</h3>
<ul>
<li>Nesta aula apresentamos sistemas de tipos como uma forma de especificar a etapa de análise
semântica em compiladores.</li>

<li>Apresentamos as propriedades de progresso e preservação e sua importância no projeto de uma linguagem.</li>

</ul>
</section>
</section>
</div>
</div>
<script src="file:///home/rodrigo/reveal.js/dist/reveal.js"></script>
<script src="file:///home/rodrigo/reveal.js/plugin/markdown/markdown.js"></script>
<script src="file:///home/rodrigo/reveal.js/plugin/notes/notes.js"></script>
<script src="file:///home/rodrigo/reveal.js/plugin/search/search.js"></script>
<script src="file:///home/rodrigo/reveal.js/plugin/zoom/zoom.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,
overview: true,

transition: 'convex',
transitionSpeed: 'default',

// Plugins with reveal.js 4.x
plugins: [ RevealMarkdown, RevealNotes, RevealSearch, RevealZoom ],

// Optional libraries used to extend reveal.js
dependencies: [
]

});
</script>
</body>
</html>
